# WinderRunInsideMinTreadDepthFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderRunInsideMinTreadDepthFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Please enter a positive value less than Actual Tread Depth on Stair Path (%Actual Tread Depth%).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderRunInsideMinTreadDepthFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderRunInsideMinTreadDepthFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderRunInsideMinTreadDepthFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace